[
    {
        "title": "Literally me...",
        "score": 2754,
        "url": "https://v.redd.it/ahhewviiwe6d1",
        "created": "2024-06-13 22:04:40",
        "comments": [
            {
                "body": "\"Hey so uhh I don't know what happened, last week I swear I had access but uh, I like, opened it this morning and uhh I'm getting an error that says I don't have access. So like, I did get it started, but I need you to give me access again so I can... Keep going. On it. Yeah.\" \n\n-not me irl",
                "score": 847,
                "created": "2024-06-13 23:01:37",
                "theme": "Victorian Accountant"
            },
            {
                "body": "\"Hey (insert manager here), I lost access to the link. Can you help me out?\"",
                "score": 235,
                "created": "2024-06-13 23:05:59",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Rookie mistake. Always start at least 5% of it. After that you can bullshit for awhile.",
                "score": 478,
                "created": "2024-06-14 01:20:47",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Oh accounting, I love how you make us feel like we are permanently in school.",
                "score": 143,
                "created": "2024-06-14 00:55:29",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I have never seen anything more relatable on this sub.",
                "score": 60,
                "created": "2024-06-14 01:37:01",
                "theme": "Victorian Accountant"
            },
            {
                "body": "😂 been there, done that.",
                "score": 101,
                "created": "2024-06-13 22:56:41",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Fuck that’s the worst😂",
                "score": 62,
                "created": "2024-06-13 23:38:46",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Whatever you do, be cool headed and calm like the dog.",
                "score": 16,
                "created": "2024-06-14 01:45:03",
                "theme": "Victorian Accountant"
            },
            {
                "body": "The good part is usually my boss is doing this to me when I’m reminding him so I feel like… it’s fiiine",
                "score": 38,
                "created": "2024-06-14 00:19:41",
                "theme": "Victorian Accountant"
            },
            {
                "body": "*3 weeks",
                "score": 6,
                "created": "2024-06-14 02:16:01",
                "theme": "Victorian Accountant"
            }
        ],
        "theme": "Victorian Accountant"
    },
    {
        "title": "Boomer partners when they have to pay staff 2024 rates instead of 1980 rates ",
        "score": 1916,
        "url": "https://i.redd.it/unwb5tk0tb7d1.jpeg",
        "created": "2024-06-18 12:43:54",
        "comments": [
            {
                "body": "\"My third wife is destroying me in divorce court, I can't afford to pay this!\"",
                "score": 517,
                "created": "2024-06-18 13:11:18",
                "theme": "Victorian Accountant"
            },
            {
                "body": "As someone who worked for a 71 year old firm owner this is painfully accurate. He was very large (tall and obese) and oh how did he reject the notion his firm paid poorly and the clients were under charged.\n\nOnly job I ever quit without notice as I genuinely imagine this would have been the exact look on the guy’s face if I offered to work a 2 weeks notice.",
                "score": 245,
                "created": "2024-06-18 13:13:36",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Scary that this is an accurate representation",
                "score": 305,
                "created": "2024-06-18 13:06:05",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I see a lot of jobs still offering 2019 rates though, seems like those jobs never get filled though.",
                "score": 94,
                "created": "2024-06-18 13:49:42",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I know an owner who was in shock at the level of comp expected for employees and basically just decided not to hire anyone new and are selling 😂",
                "score": 23,
                "created": "2024-06-18 17:28:34",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I just start passing on jobs that don’t have at least 20-30% difference from the government jobs at the similar experience required. \n\nWhenever I start interviewing places, I just mention that it seems like the starting salary for similar experiences for these kind of positions are somewhere between “blah blah blah and I expect somewhere between those salary.”",
                "score": 38,
                "created": "2024-06-18 14:30:16",
                "theme": "Victorian Accountant"
            },
            {
                "body": "One too many pizza parties.",
                "score": 19,
                "created": "2024-06-18 15:24:01",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Fucking boomers",
                "score": 42,
                "created": "2024-06-18 14:28:16",
                "theme": "Victorian Accountant"
            },
            {
                "body": "It is bad when the pay is about the same working at a gas station",
                "score": 14,
                "created": "2024-06-18 16:11:40",
                "theme": "Victorian Accountant"
            },
            {
                "body": "When the boomer partner making >$300k gets mad cause you didn’t process his $100 expense report",
                "score": 11,
                "created": "2024-06-18 22:25:36",
                "theme": "Victorian Accountant"
            }
        ],
        "theme": "Victorian Accountant"
    },
    {
        "title": "Boomer Partners Selling Out To Private Equity And Riding Off Into The Sunset",
        "score": 1768,
        "url": "https://i.redd.it/5uttdpsd9b6d1.png",
        "created": "2024-06-13 09:50:25",
        "comments": [
            {
                "body": "We have an all hands today about this very thing 😩",
                "score": 498,
                "created": "2024-06-13 12:06:14",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I was an income partner and I got boned in one of these situations.  Equity partners got a fat payday.   Just before Christmas, I was handed a NC and told I could keep my job as a manager or I could buy in as a partner for $500k.  I gave them the middle finger, took all of my own clients and many of the equity partners' clients and jumped to another firm.  The equity partners lost it - \"How could you do this to us?!?  This is going to affect our earn-out!\"   One of them actually cried and I probably sound horrible but it made me laugh out loud at him.",
                "score": 85,
                "created": "2024-06-13 23:28:03",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Is this about Grant Thornton or is another one happening",
                "score": 73,
                "created": "2024-06-13 14:04:08",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I'm billed out at $275/hr while I question if I'll ever be able to own a halfway decent home (>$800k in my area). Can't wait for PE to 'modernize' our comp structure, as they claim.",
                "score": 254,
                "created": "2024-06-13 12:26:24",
                "theme": "Victorian Accountant"
            },
            {
                "body": " Ah, the classic boomer move! Selling out to private equity and riding off into the sunset with pockets full of cash.",
                "score": 223,
                "created": "2024-06-13 11:03:01",
                "theme": "Victorian Accountant"
            },
            {
                "body": "\"pRoMIsing FuTUre foR tHe FirM aNd OuR vAlUaBLe aUdIT tEAm MemBErs\"",
                "score": 45,
                "created": "2024-06-13 15:31:50",
                "theme": "Victorian Accountant"
            },
            {
                "body": "As if they hadn’t already won enough by being able to purchase large homes for $100k 35 years ago",
                "score": 126,
                "created": "2024-06-13 11:59:08",
                "theme": "Victorian Accountant"
            },
            {
                "body": "They finally found a way out of succession planning. Just slap some PE Flex Tape on that bad boy and move on with life.",
                "score": 20,
                "created": "2024-06-13 18:01:30",
                "theme": "Victorian Accountant"
            },
            {
                "body": "It is actually worse.   They are selling off and NOT riding off into the sunset.  They are staying with their firms and collecting their big salaries.  The only way they can make this work is by outsourcing work to India, putting more burden on US staff (who will have deal with time differences and  eat hours).",
                "score": 20,
                "created": "2024-06-13 19:33:47",
                "theme": "Victorian Accountant"
            },
            {
                "body": "We literally had a firm wide meeting today regarding this lol",
                "score": 21,
                "created": "2024-06-13 19:44:42",
                "theme": "Victorian Accountant"
            }
        ],
        "theme": "Victorian Accountant"
    },
    {
        "title": "You guys are really underselling the profession tbh",
        "score": 1684,
        "url": "https://www.reddit.com/r/Accounting/comments/1dqvok7/you_guys_are_really_underselling_the_profession/",
        "created": "2024-06-28 22:08:38",
        "comments": [
            {
                "body": "Welcome to the profession. We maintain pay and job security by pretending it’s harder than it actually is. Now do you want to delete this post or do we need to have a talk?",
                "score": 2011,
                "created": "2024-06-28 22:21:38",
                "theme": "Victorian Accountant"
            },
            {
                "body": "What I noticed at least in college was that most of the students there came from middle class backgrounds or upper middle class backgrounds. I always felt like the brokest one there. A lot of the students there had not experienced a full time job yet and have only worked part-time, many didn’t even work during the school year and only did part time in the summer. PA is demanding and if it’s your first job the I can see how it’s overwhelming.\n\nFor someone who was raised lower middle class with single mom this profession has been god send. I had a job lined up as soon as I graduated college while many graduates struggle to find jobs, I make a decent living. I no longer have to work at restaurants, all those hours in restaurants dealing with shitty managers and sometimes bad customers and busy days are over and paid off. Those summers I worked construction are now gone. \n\nI have the opportunity to work from home, everyone is super chill, nobody is on your ass at anytime, literally as long as you finish your tasks then no one has a problem with you. I make more money now than I’ve ever made and I do way less. For all of us who grow up poor and studied accounting we love this profession. Being in the comfortable AC while working, not having to come home smelly from cooking and serving  food, not having to drive 1 hour to the construction site. I couldn’t be happier.",
                "score": 285,
                "created": "2024-06-28 23:53:11",
                "theme": "Victorian Accountant"
            },
            {
                "body": "That’s funny. I’m a welder now and I’m about to start school for accounting. Id much rather be worried about my ass hurting from sitting all day than losing a finger due to working with idiots or equipment malfunction",
                "score": 322,
                "created": "2024-06-28 23:50:15",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I think the reason there's so much opportunity for accountants these days is because they are often overlooked. Great for future accountants since low supply high demand is economics 101 for market opportunity. Glad it's not as competitive as engineering/finance since in any profession you have to go through bs at the beginning when you're first learning.\n\nHOWEVER, I would 100% say stay away from Big\n4 but often accountants tend to be risk adverse and seek stability in these firms. The WLB is non-existent and the money is terrible for the hours worked. In my opinion the best route is working for smaller PA firms  that have small business clients. Wide variety of work since you prepare the financial statements and tax return for each business and get to see what kind of sneaky companies make a killing which is very intellectually stimulating in my experience. Plus the work life balance is usually much better, I'm talking 45 hour busy season for two months in personal tax season with 37.5 hours the rest of the year focused on corporate work. Stay away from audit though, unless that is your passion. The work is mind numbing box ticking and you are often working on non for profit organizations, which personally is not my cup of tea. \n\nBut then again, no one tell you these things in school,  they don't prepare you for the real world at all. That's why I believe this subreddit is one of the best resources for people entering the profession.",
                "score": 153,
                "created": "2024-06-28 23:08:19",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I've been in PA for over a year now.\n\nPros: Stable income, great prospects, I'm doing better than probably 50% or more of people my age.\n\nCons: Insomnia, I've gained 10lbs, my soul has been drained",
                "score": 355,
                "created": "2024-06-28 22:17:28",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Some days are great. Days like I had today make me want to be a squirrel instead. See ya, sucker's. I'll be in the trees.",
                "score": 38,
                "created": "2024-06-28 22:39:43",
                "theme": "Victorian Accountant"
            },
            {
                "body": "This sub, like many subreddits, doesn’t truly represent what the accounting profession can offer. Many accountants don’t use Reddit. Even fewer actively participate in this sub. And if they do, it’s usually the same opinion they know will get upvotes. Accounting is not a perfect job, but it is a good one.",
                "score": 34,
                "created": "2024-06-29 00:32:41",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I agree with OP.\n\nHonestly, your career is what you make it. I have had a very fulfilling and lucrative career in accounting (tax) for almost 30 years now.  In general, I would say I have never been bored with my job.  I didn't have to sell my soul to a firm or work 90 hours a week to get where I am.  I just had to advocate for myself and what I wanted out of my career.  If you settle for sitting in a cube doing PPE reconciliations for your whole career, that's on you.  There are many exciting and interesting paths to take in this field but you can't wait for them to come to you.  \n\nI would encourage anyone to join the profession.  I have no regrets and it has given me and my family an amazing life.",
                "score": 70,
                "created": "2024-06-28 23:34:37",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I didn't try in school and fell into accounting and glad I did.  \n\n\nPeople don't appreciate how easy a stable accounting job allows you to enjoy your hobbies and take care of your family. \n\n\n I'm easily able to afford my coke habit and pay child support every month! All while sitting on my ass indoors!",
                "score": 61,
                "created": "2024-06-28 23:52:07",
                "theme": "Victorian Accountant"
            },
            {
                "body": "For real, I used to work as a cashier, standing all the time and pushing carts outside the store to bring them in during a hot or very cold weather. Now I work for the government, and I prolly work for maybe 30 mins to 1 hr everyday lol while making good money. I sit all day, could browse reddit and listen to music anytime while making good money.\n\nId rather have this \"boring\" work than be busy 🤣 and oh yeah I get to WFH!",
                "score": 40,
                "created": "2024-06-28 23:40:29",
                "theme": "Victorian Accountant"
            }
        ],
        "theme": "Victorian Accountant"
    },
    {
        "title": "This is the best career sub on reddit",
        "score": 1606,
        "url": "https://www.reddit.com/r/Accounting/comments/1dglty4/this_is_the_best_career_sub_on_reddit/",
        "created": "2024-06-15 16:32:21",
        "comments": [
            {
                "body": "The problem is this sub is the best thing about being accountant. Only gets worse from here",
                "score": 1613,
                "created": "2024-06-15 16:54:37",
                "theme": "Victorian Accountant"
            },
            {
                "body": "LOL nice try AICPA you guys are really putting membership dues to good use.",
                "score": 503,
                "created": "2024-06-15 17:39:45",
                "theme": "Victorian Accountant"
            },
            {
                "body": "This is great to hear, we've always made it a point that the community members control the community with what content is shared and discussed and the direction it takes through the voting and reporting system.\n\nIt's been important to us to maintain a stand back approach to moderation. Our main focus of action is monitoring reports and removing spam, solicitations, and addressing disrespectful and uncivil comments. Aside from that we don't like to interfere and are regular members of the community like everyone else.\n\nI'll leave you with a favorite quote of mine from Futurama that sums this up:\n\n>When you do things right, people won't be sure you've done anything at all.",
                "score": 590,
                "created": "2024-06-15 16:55:25",
                "theme": "Victorian Accountant"
            },
            {
                "body": "One thing about accountants is that we are great at sharing our thoughts….in anonymity.",
                "score": 154,
                "created": "2024-06-15 17:07:02",
                "theme": "Victorian Accountant"
            },
            {
                "body": ">I am an electrical engineer. My job is not as exciting as you think it is.         \n      \nDon't worry, I know engineers and already knew your job wasn't exciting.",
                "score": 80,
                "created": "2024-06-15 17:56:06",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Marketing guy here.. i hated accounting classes at university.. never wanted to learn or become one. But i am following this one for some reason. And i agree its the best one..",
                "score": 45,
                "created": "2024-06-15 17:49:40",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Lol, you had me until the \"fine money\" part. See you Monday boss.",
                "score": 265,
                "created": "2024-06-15 16:45:44",
                "theme": "Victorian Accountant"
            },
            {
                "body": "One thing I like about the accounting sub is that we're all a bit cynical. Other groups get so defensive about their professions whereas we will openly acknowledge the flaws.\n\nFor example, one time I commented that a realtor was way too invested in someone using a particular lender and maybe they were getting a kickback from it. So this loan guy jumps in all \"we would Never\" and \"we have Ethics\" and \"banks are highly Regulated\" like he's being personally attacked. Meanwhile in the accounting reddit, if someone in or out of the profession asks if something is sketchy, people will evaluate it based on what's described rather than jumping to \"CPAs have a code of ethics!!\"",
                "score": 70,
                "created": "2024-06-15 21:29:28",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I never understood why folks don’t think we make good money- sure there are always more lucrative examples but on average out of my friends group, wife’s friends group, most people interact with etc… I’m usually very well set and don’t have huge risks with layoffs etc. additionally- sky is the limit as I see it. At 33 I no where believe I am close to my top earnings and do quite fine.",
                "score": 53,
                "created": "2024-06-15 17:42:19",
                "theme": "Victorian Accountant"
            },
            {
                "body": "This is the best subreddit in existence, I can agree with that. But I shouldn’t be so surprised, since us accountants are known for being kind, incredibly attractive, charismatic, and humble. I suppose it’s just par for the course in this esteemed profession",
                "score": 44,
                "created": "2024-06-15 19:00:14",
                "theme": "Victorian Accountant"
            }
        ],
        "theme": "Victorian Accountant"
    },
    {
        "title": "Big 4 life cycle",
        "score": 1428,
        "url": "https://i.redd.it/1czrbgkjol4d1.png",
        "created": "2024-06-04 18:44:23",
        "comments": [
            {
                "body": "I like how the videos got less and less views over time too. As the experiences become more real and less dreams (and nightmares), then the need for the vlog expired.",
                "score": 625,
                "created": "2024-06-04 18:45:49",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I went to school with her at USC lol \n\nDid not expect her to be a YouTuber LMAO",
                "score": 139,
                "created": "2024-06-04 23:20:41",
                "theme": "Victorian Accountant"
            },
            {
                "body": "She's annoying af now. \"Retired\" because she's a millionaire and sells some BS financial guru course. Screams trust fund baby. Worked 2 years and called it a career.",
                "score": 80,
                "created": "2024-06-05 04:01:10",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Do people really still not know what they are signing up for when joining big 4?",
                "score": 215,
                "created": "2024-06-04 19:52:37",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I only saw her posts’ titles:\n\n59. How to retired in 7 years starting with $0 in your 20s.\n\n60. How I retired early at 25 with $1.5m in California.\n\nI’m not really good at mental math but something seems odd 👀",
                "score": 18,
                "created": "2024-06-05 09:30:19",
                "theme": "Victorian Accountant"
            },
            {
                "body": "looked her up and she's a financial independence grifter now",
                "score": 16,
                "created": "2024-06-05 05:05:50",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Can you idiots just please stop working for big4? It's not good for you. Never has been. You will NEVER get the carrot they are dangling.",
                "score": 118,
                "created": "2024-06-04 21:02:14",
                "theme": "Victorian Accountant"
            },
            {
                "body": "VLOG #69: Pizza parties at Big 4\nVLOG #72: Random meeting with HR and Partner scheduled at Big 4\nVLOG #74: So I got laid off Big 4, what's next?\nVLOG #77: Moving out of apartment, can't find job\nVLOG #79: Post Big 4, what am I up to now? Finally happy",
                "score": 29,
                "created": "2024-06-04 22:30:21",
                "theme": "Victorian Accountant"
            },
            {
                "body": "God imagine feeling the compulsion to document every mundane thing you do on YouTube.",
                "score": 76,
                "created": "2024-06-04 19:39:13",
                "theme": "Victorian Accountant"
            },
            {
                "body": "God, imagine having to work on a team with her",
                "score": 36,
                "created": "2024-06-04 20:19:13",
                "theme": "Victorian Accountant"
            }
        ],
        "theme": "Victorian Accountant"
    },
    {
        "title": "I actually cannot with our India team..",
        "score": 1171,
        "url": "https://www.reddit.com/r/Accounting/comments/1dst9me/i_actually_cannot_with_our_india_team/",
        "created": "2024-07-01 13:41:29",
        "comments": [
            {
                "body": "Write a letter to your congress people, not even joking. Offshoring sensitive financial work should be illegal.",
                "score": 835,
                "created": "2024-07-01 16:07:44",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Solution: leave and work for a firm that doesn't offshore. That's what I did. I hate the practice of sending off work to India when most likely the client doesn't know that it's occurring w/ the consent form being buried in a bunch of other red tape engagement agreement docs.",
                "score": 490,
                "created": "2024-07-01 13:49:18",
                "theme": "Victorian Accountant"
            },
            {
                "body": "India offshoring is a waste of fucking time.  No one wants to work with them because they aren't real employees and can't be relied on for anything ongoing.\n\nNot only does it take longer to fix their mistakes , they usually just disappear.\n\nI don't blame them completely, I have heard how their managers treat them.",
                "score": 321,
                "created": "2024-07-01 14:22:21",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Then they hire less US associates and delay their start dates. I'm fine with offshore if there's US talent shortage, but that's not the case right now at that entry level.",
                "score": 58,
                "created": "2024-07-01 15:51:01",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Kindly do the needful",
                "score": 301,
                "created": "2024-07-01 14:26:12",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Do the needful and get out of there, lol.",
                "score": 267,
                "created": "2024-07-01 14:08:12",
                "theme": "Victorian Accountant"
            },
            {
                "body": "It's very wild that company allows their tax being prepared by foreigners who have no clue how their taxation works.",
                "score": 217,
                "created": "2024-07-01 13:58:27",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Behind the scenes is a ton of them don’t even have accounting degrees they just take an excel class and follow checklists ….",
                "score": 104,
                "created": "2024-07-01 14:50:28",
                "theme": "Victorian Accountant"
            },
            {
                "body": "US government is a freaking joke. They ban TikTok over a supposed worry of data BUT allow some of the most confidential information to be sent to a country known to sell data like no tomorrow.",
                "score": 142,
                "created": "2024-07-01 15:12:22",
                "theme": "Victorian Accountant"
            },
            {
                "body": "see how much they get paid, I would say you are getting what you paid for ….",
                "score": 30,
                "created": "2024-07-01 15:05:27",
                "theme": "Victorian Accountant"
            }
        ],
        "theme": "Victorian Accountant"
    },
    {
        "title": "Meme time",
        "score": 1090,
        "url": "https://i.redd.it/1p87xg3igx6d1.jpeg",
        "created": "2024-06-16 12:28:47",
        "comments": [
            {
                "body": "A professional violinists face when their 350+ year old stradavarious is fully depreciated in 5-7 years and they read the IRC provision that says periods of depreciation are intended to coincide with the expected life of the property....",
                "score": 146,
                "created": "2024-06-16 14:18:05",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Mfw the fully depreciated land is still in use: 🫢",
                "score": 166,
                "created": "2024-06-16 12:55:17",
                "theme": "Victorian Accountant"
            },
            {
                "body": "IRL asset still has 10 years of amortization left while being rusted out in the yard.",
                "score": 156,
                "created": "2024-06-16 13:38:29",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Classic image",
                "score": 11,
                "created": "2024-06-16 13:52:33",
                "theme": "Victorian Accountant"
            },
            {
                "body": "100% methods in the first year can kiss my ass. Just makes it a shell game and Ponzi Scheme for the tax cheat clients who get addicted to financing stupid things for that one time rush, and expect us to keep making their taxes go away. \n\nI don't know the IRS ever allowed people to take bonus or 179 on something that was leased or financed.",
                "score": 27,
                "created": "2024-06-16 14:44:52",
                "theme": "Victorian Accountant"
            },
            {
                "body": "It's kinda weird that equipment could still be functional and yet have a CA of zero.",
                "score": 10,
                "created": "2024-06-16 13:42:22",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Someone hasn’t been to a manufacturing plant before. There is shit running there that saw the Berlin Wall go up and down.",
                "score": 4,
                "created": "2024-06-17 02:33:31",
                "theme": "Victorian Accountant"
            },
            {
                "body": "First boss I had sternly told me that accounting and tax depreciation were separate calculations and any accountant that combined the two was lazy. Since then I have only worked with lazy accountants.",
                "score": 3,
                "created": "2024-06-17 03:44:27",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I joined this sub because of memes.\n\nNow it's only americans complaining about their jobs....",
                "score": 10,
                "created": "2024-06-16 18:48:33",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Change ownership to my family member’s name so I can exaggerate it again. Legal pun intended 🙈",
                "score": 1,
                "created": "2024-06-17 20:19:02",
                "theme": "Victorian Accountant"
            }
        ],
        "theme": "Victorian Accountant"
    },
    {
        "title": "why is accounting your passion?",
        "score": 1059,
        "url": "https://i.redd.it/d7s7bdh5z06d1.jpeg",
        "created": "2024-06-11 23:15:29",
        "comments": [
            {
                "body": "[deleted]",
                "score": 215,
                "created": "2024-06-12 01:43:47",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I do it to make ends, and no other reason.",
                "score": 120,
                "created": "2024-06-11 23:36:02",
                "theme": "Victorian Accountant"
            },
            {
                "body": "IDK; but I get super hard every time I walk into the audit room.",
                "score": 136,
                "created": "2024-06-12 01:02:01",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I, personally, do this job for the direct deposit",
                "score": 59,
                "created": "2024-06-12 02:30:13",
                "theme": "Victorian Accountant"
            },
            {
                "body": "It’s not. \n\nI hate myself more and more every day I go to work. However, providing a better childhood for our daughter than we ever had makes me keep wanting to get up every morning to do so. She will never have to worry about not having enough food or hot water like I did as a kid. Ever. Thats what keeps me smiling and makes it worth it. \n\nIt’s a paycheck to me.",
                "score": 43,
                "created": "2024-06-12 04:14:22",
                "theme": "Victorian Accountant"
            },
            {
                "body": "For real though, I can't describe how nice it is to see the number in my bank account go up.",
                "score": 38,
                "created": "2024-06-12 01:34:46",
                "theme": "Victorian Accountant"
            },
            {
                "body": "After 30 years in retail I don’t have to talk to retail customers. 15 years restaurants, 15 years car business",
                "score": 16,
                "created": "2024-06-12 04:35:26",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Accounting cycles, whether it be monthly or yearly, are like puzzles for me.  The financial statement is the completed puzzle, and it’s satisfying to complete one and see what it says about financial health of the entity.  I like the idea of being a “business doctor” of sorts.  The financials tell you everything!  Sounds nerdy, but it’s the truth!",
                "score": 57,
                "created": "2024-06-12 01:57:12",
                "theme": "Victorian Accountant"
            },
            {
                "body": "I do it so I don't end up losing everything ",
                "score": 15,
                "created": "2024-06-12 03:06:57",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Getting yelled at by irrational clients is my kink.",
                "score": 11,
                "created": "2024-06-12 12:01:22",
                "theme": "Victorian Accountant"
            }
        ],
        "theme": "Victorian Accountant"
    },
    {
        "title": "6 figure club babyyyyy",
        "score": 1663,
        "url": "https://www.reddit.com/r/Accounting/comments/1dtu85u/6_figure_club_babyyyyy/",
        "created": "2024-07-02 19:20:15",
        "comments": [
            {
                "body": "Congrats on becoming a remote controller!",
                "score": 1312,
                "created": "2024-07-02 19:42:45",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Congratulations! Have fun controlling that ass",
                "score": 503,
                "created": "2024-07-02 19:58:50",
                "theme": "Victorian Accountant"
            },
            {
                "body": "heck yea brudder",
                "score": 64,
                "created": "2024-07-02 19:44:13",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Welcome to the club of 'my title is misleading'.",
                "score": 440,
                "created": "2024-07-02 19:56:50",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Ass to the controller*",
                "score": 53,
                "created": "2024-07-02 20:28:07",
                "theme": "Victorian Accountant"
            },
            {
                "body": "The amount of people calling 100k shit money is crazy. Acting like that's the average US salary or some shit",
                "score": 113,
                "created": "2024-07-02 23:06:43",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Damn I'm an ASS. controller, but only making $95k and not fully remote.  Good for you!",
                "score": 28,
                "created": "2024-07-02 21:38:00",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Please don’t be shy. Tell us your story about how you arrived there lol",
                "score": 46,
                "created": "2024-07-02 20:01:31",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Fuck public accounting lets gooooo",
                "score": 22,
                "created": "2024-07-02 23:56:31",
                "theme": "Victorian Accountant"
            },
            {
                "body": "Amazing\n\nCan't wait for the eventual - I made a mistake, this is a nightmare job post",
                "score": 67,
                "created": "2024-07-02 20:25:14",
                "theme": "Victorian Accountant"
            }
        ],
        "theme": "Victorian Accountant"
    }
]